app/controllers/guestbook/messages_controller.rb

    def index
      @post = Guestbook.new
      @posts = Guestbook.order('id DESC').paginate(:page => params[:page], :per_page => 4)
---
SELECT "guestbooks".* FROM "guestbooks" ORDER BY id DESC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "guestbooks"

    def say
      @post = Guestbook.new
      @post.time = Time.now

      if user_signed_in?
        @post.author = current_user.login
        @post.email = current_user.email

      else
        @post.author = 'Guest'
        @post.email = 'Guest'
      end

      @post.message = params[:message]

      if @post.save
---
INSERT INTO "guestbooks" ("author", "email", "message", "time") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author", "Guest"], ["email", "Guest"], ["message", "jhkjhkjhk"], ["time", Sun, 21 Jul 2013 08:47:38 MSK +04:00]]