app/controllers/users_controller.rb

  def index

    @users = User.order('id DESC').paginate(:page => params[:page], :per_page => 5)
---
SELECT "users".* FROM "users" ORDER BY id DESC LIMIT 5 OFFSET 0

  def show

    @user =  User.where(:login => params[:user])

    if @user.count == 0
---
SELECT "users".* FROM "users" WHERE "users"."login" = 'taktes'
SELECT COUNT(*) FROM "users" WHERE "users"."login" = 'taktes'